#
#   ____                     __ _ _
#  | __ ) _ __ _____      __/ _(_) | ___
#  |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
#  | |_) | | |  __/\ V  V /|  _| | |  __/
#  |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#

# Reference: https://github.com/Homebrew/homebrew-bundle
# https://github.com/Homebrew

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask'

# brew install <package>
brew 'git'
brew 'nvim'
brew 'tmux'
brew 'fzf'
brew 'ripgrep'
brew 'bat'
brew 'tree'
brew 'icdiff'
brew 'diff-so-fancy'

brew 'node'
brew 'python'
brew 'pyenv'
brew 'rbenv'
brew 'rustup'
brew 'elixir'

# https://caskroom.github.io/
cask_args appdir: '/Applications'

cask 'spotify'
cask 'alfred'
cask 'firefox'
cask 'visual-studio-code'
cask 'font-fira-code-nerd-font'
